benchmark/result.txt
------------------------------------------------------------------------------------------
Test on:
	Hardware: Intel Xeon E5440 2.83GHz 4G RAM
	OS: Windows Server 2003 R2 Service Pack 2
------------------------------------------------------------------------------------------

// put messages to queue

C:\benchmark>ab -k -c 10 -n 100000 "http://127.0.0.1:1218/?name=test&opt=put&data=aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"

==========================================RESULT===========================================
Document Length:        14 bytes

Concurrency Level:      10
Time taken for tests:   6.563 seconds
Complete requests:      100000
Failed requests:        0
Write errors:           0
Keep-Alive requests:    100000
Total transferred:      16388895 bytes
HTML transferred:       1400000 bytes
Requests per second:    15237.32 [#/sec] (mean)
Time per request:       0.656 [ms] (mean)
Time per request:       0.066 [ms] (mean, across all concurrent requests)
Transfer rate:          2438.70 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0      16
Processing:     0    1   4.9      0     391
Waiting:        0    1   4.9      0     391
Total:          0    1   4.9      0     391

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%     16
  99%     16
 100%    391 (longest request)

===========================================================================================

// get messages from queue

C:\benchmark>ab -k -c 10 -n 100000 "http://127.0.0.1:1218/?name=test&opt=get"

==========================================RESULT===========================================
Document Length:        512 bytes

Concurrency Level:      10
Time taken for tests:   6.485 seconds
Complete requests:      100000
Failed requests:        0
Write errors:           0
Keep-Alive requests:    100000
Total transferred:      66288895 bytes
HTML transferred:       51200000 bytes
Requests per second:    15420.90 [#/sec] (mean)
Time per request:       0.648 [ms] (mean)
Time per request:       0.065 [ms] (mean, across all concurrent requests)
Transfer rate:          9982.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0      16
Processing:     0    1   3.4      0     125
Waiting:        0    1   3.4      0     125
Total:          0    1   3.4      0     125

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%     16
  99%     16
 100%    125 (longest request)

===========================================================================================